var obj = {
    protocolText: function () {
        return `作业无忧《
    作业无忧用户服务协议》

    生效日期： 2020 年 05 月17 日星期日

    在您下载、 安装或使用作业无忧APP产品及任何随附的文档（ 如有）， 包括提供给您的更新或升级版本（ 依据本协议之外的其他协议提供给您的更新或升级版本除外）（ 下文统称“ 作业无忧”） 之前， 请您务必仔细阅读本协议中约定的下述条款。

    请您仔细阅读以下条款， 在您同意并接受本协议全部条款的前提下， 公司将作业无忧的合法使用授权授予您。 如果您是未成年人， 则请您在法定监护人陪同下审阅和判断是否同意本协议， 未成年人使用作业无忧的行为视为已获得了法定监护人的认可。 如果您不同意接受本协议的全部条款， 则您无权注册、 登录或使用本协议所涉及服务， 您下载、 安装、 使用作业无忧等行为， 则意味着您将自愿遵守本协议及作业无忧的其他有关规则， 并完全服从于作业无忧的统一管理。

    作业无忧有权根据业务需要对本协议不定时进行调整， 并将调整后的协议公布于公司官网或者作业无忧APP中， 如果您不同意调整后的本协议的， 您应当停止使用作业无忧， 否则， 如果在公司调整本协议并公布后， 您继续使用作业无忧提供的服务的， 则视为您同意遵守调整后的协议。

    一、 用户的权利与义务

    1. 用户须通过合法渠道（ 包括但不限于各大应用市场、 作业无忧官网） 下载、 安装并使用作业无忧， 这是您获得作业无忧使用授权的前提。

    2. 用户一经注册或登录使用作业无忧， 即视为用户同意公司的客服人员与其进行电话联系。

    3. 用户在作业无忧内享有的服务内容由公司根据实际提供， 并有权不时进行增加、 删除、 修改、 或调整， 包括但不限于：

    （ 1） 拍照搜题（ 语音搜题、 文字搜题）： 用户通过题目拍照（ 语音、 文字） 根据题库内容反馈问题答案解析。

    （ 2） 问答解题： 用户通过照片、 语音、 文字内容向其他用户提问， 其他用户自愿给出解答内容， 作业无忧不对解答内容承担任何责任。

    （ 4） 老师答疑辅导： 用户可通过答疑入口约定老师进行即时答疑， 所产生费用由用户自行承担。

    （ 5） 家教订单： 学生可通过客服联系家教老师， 所产生费用由用户自行承担。

    4. 使用作业无忧时产生的通讯流量费用由用户自行承担。

    5. 用户应妥善保管自己的账号、 密码， 不得转让、 出借、 出租、 出售或分享予他人使用。 否则作业无忧有权根据实际情况暂时封停或永久查封此账号， 当用户的账号或密码遭到未经授权的使用时， 用户应当立即通知作业无忧， 否则未经授权的使用行为均视为用户本人行为。

    6. 公司有权随时对作业无忧提供的服务内容等进行调整， 包括但不限于增加、 删除、 修改作业无忧服务内容， 一旦作业无忧的服务内容发生增加、 删除、 修改， 作业无忧将在相关页面上进行提示； 如果用户不同意相关变更和修改， 可以取消已经获取的服务并停止使用； 如果用户继续使用作业无忧提供的服务， 则视为用户已经接受全部变更、 修改。 除非另有明确约定， 否则用户使用作业无忧内新增的服务内容将同样受本协议各项条款的约束。

    7. 作业无忧内提供的服务分为免费服务和收费服务。 对于现阶段免费提供的服务内容， 公司有权随时根据公司政策的调整将其变更为收费服务， 如果发生该等变更的， 公司将提前告知用户， 如果用户不同意的， 可以停止使用该服务。 对于收费的服务内容， 公司有权自行确定该等服务的价格并不时调整， 调整后的价格将在作业无忧平台中进行公示， 如果用户不同意调整后的价格的， 则用户可以在其原购买的收费服务到期后停止付费购买收费服务。 如果用户在公司调整价格并公示后， 仍继续购买收费服务的， 则视为用户同意该调整后的价格。

    8. 用户如对付费购买的服务不满意的， 有权终止服务。 用户需在规定时间内， 在客户端自行申请或拨打客服电话， 申请终止服务及退款， 退款金额按照客户端公示的退款规则计算， 公司有权根据业务发展不时调整退款规则并在端内公示； 如果客户端公示的退款规则跟本协议约定不一致的， 以客户端公示的为准。 其中， 购买1对1辅导的用户， 需在套餐有效期内对未使用的时长提出退款申请； 购买其他付费服务的退款按照平台内公示的规则执行。 如果用户在购买付费服务时使用了本协议第一条第8、 9 款约定的优惠券或折扣等其他优惠方式的， 则用户按照本款约定申请退款时， 用户无权就该等优惠券或折扣申请退款或补偿。 公司有权保留已终止服务的用户的所有使用信息， 对用户在使用付费服务期间发生的违反本协议及相关规定的行为， 公司仍有权行使本协议规定的权利并追究用户的法律责任。

    9. 公司不时将对付费服务提供优惠政策或开展优惠活动， 该等优惠政策或优惠活动以作业无忧平台上的实时信息为准， 用户知悉并认可， 公司作有权自行决定是否提供优惠政策或开展优惠互动， 以及优惠政策或优惠活动的内容、 条件和有效期， 并不时进行调整或终止。

    10. 如果用户通过合法方式获得了相关付费服务的优惠券或折扣等其他优惠方式的， 则用户知悉并认可， 该等优惠券或折扣必须满足一定条件才能使用， 以优惠券上的信息提示和优惠券使用说明、 或作业无忧公示的折扣使用说明为准。 优惠券或折扣不兑现（ 即不直接兑换现金）、 不找零（ 即订单金额不足抵用券金额的， 抵用券剩余金额无效）、 过期作废； 优惠券或折扣仅限同一用户账号使用， 严禁出售、 转让或共享， 如经公司发现存在出售、 转让或共享优惠券或折扣等其他优惠方式的， 该优惠券或折扣将予以作废处理， 且公司有权视情节严重程度予以封号处理， 并保留追究相关责任人法律责任的权利。

    11. 公司禁止以任何形式倒卖、 贩售、 出租、 出借、 转让用户账号、 优惠券或折扣等其他优惠方式及使用第三方渠道（ 即非作业无忧官方渠道） 代充学币的行为， 一经查明， 公司将采取包括但不限于封号、 封禁IP、 追究相关责任人法律责任的处理措施。

    二、 平台管理

    作业无忧存在专门的审核团队对用户使用作业无忧的行为进行监督和审核， 用户也可通过举报的方式对使用过程中发现的不良内容进行举报。 一旦发现作弊及发布违反作业无忧规定的行为， 我们将于24小时内对违规用户进行处理。

    1. 作弊行为与处罚方法

    （ 1） 作弊的行为包括但不限于通过非公平不正当途径获取积分、 利用系统漏洞获取优惠或做异常使用、 违规贩卖优惠券、 使用第三方渠道（ 即非作业无忧官方渠道） 代充学币等。 对于作弊行为的判断， 公司保留最终解释权。 特别注意： 任何形式的自问自答， 刷分， 转分， 送分等都属于作弊行为。

    （ 2） 作弊的处罚指向所有通过非正当行为获得的积分、 优惠、 购买的课程等， 作弊所得将被全部扣除。 涉嫌作弊行为一经初步确认， 涉及该涉嫌作弊行为的所有相关用户的登录账号将被酌情扣分、 有限期封禁， 情节严重者会被永久封禁， 甚至进行刑事追诉。 涉嫌作弊内容的发布者在作业无忧平台上发布的内容（ 不论作弊与否） 均将被严肃处理， 情节严重者将被删除在作业无忧平台上发布的全部提问内容。

    2. 问答、 评论、 文档、 知识删除原则与处罚方法

    （ 1） 在作业无忧产品使用期间， 公司有权删除不符合法律法规、 部门规章、 公序良俗的问答、 评论、 帖子等， 以及公司认为跟作业无忧产品和服务不相关或者认为不适当、 不合理的用户内容， 包括但不限于， 含有色情、 暴力、 恐怖内容， 具有广告性质， 含有反动内容， 含有人身攻击内容， 含有违背伦理道德内容， 具有恶意、 无聊和灌水性质， 涉及违法犯罪的内容， 以及其他违反法律及作业无忧平台管理制度的内容。

    （ 2） 相应处罚方法

    问题被删除后， 提问者的积分将被酌情扣除0到20分。

    回复被删除后， 回答者的积分将被酌情扣除0到10分。

    帖子被删除后， 发帖者的积分将被酌情扣除0到5分。

    由于问题 / 原帖被删除而导致的回复、 评论删除不单独扣分。

    情节严重者， 将酌情对其进行加倍扣分、 有限期封禁和永久封禁等处罚。

    3. 对账号的管理原则

    （ 1） 您应保证您注册、 登录并使用的账号符合中国相关法律法规的规定， 符合《 互联网用户账号名称管理规定》， 符合本协议的各项规定。 公司有权对您注册、 登录并使用的账号名称、 头像和简介等注册信息进行审核， 您确保您登录本软件使用的用户账号名称、 头像和简介等信息中不得出现违法和不良信息， 不存在以虚假信息骗取账号名称注册的情形； 您应确保您登录作业无忧使用的用户账号名称不得为您冒用关联机构或社会名人注册的账号名称。

    （ 2） 如果您以虚假信息骗取账号名称注册， 或您的账号头像、 简介等注册信息存在违法和不良信息的， 公司有权采取通知限期改正、 暂停使用、 注销登记等措施； 如果您冒用关联机构或社会名人注册账号名称的， 公司有权注销您的账号， 并向互联网信息内容主管部门报告。

    （ 3） 凡用户存在作弊行为， 发布广告， 发布黄色、 反动内容， 发布不文明内容， 抄袭， 模仿管理人员ID， 用以假冒管理人员或破坏管理人员形象， 模仿或盗用他人ID 个人签名， 发布的内容包含有严重影响网友浏览的内容或格式， 或者存在其他扰乱作业无忧秩序的， 或影响作业无忧一课正常经营行为的， 公司有权删除其相应账号， 情节严重者， 将酌情封禁对应IP。

    （ 4） 作业无忧提供账号注销功能， 可以在“ 作业无忧” - “我的” - 设置 - 注销作业无忧账号中实现。 注销账号之后此账号内的数据无法恢复， 包括但不限于账户内的资产信息如学币、 帮帮币、 优惠券等； 账号信息内容也将全部清除， 包含但不限于该账号发布过的文章、 评论等。 注销行为操作后无法撤销， 请用户谨慎申请。

    4. 投诉、 举报制度

    如果您认为作业无忧中的提问、 回答、 帖子、 发言或其他信息、 资料、 内容等存在违反法律法规及作业无忧平台相关管理规定的， 涉嫌侮辱或者诽谤他人， 或者侵犯您或第三方的商标权、 著作权或其他合法权利情形的， 您可以通过作业无忧APP内“ 我要吐槽” 渠道进行举报、 投诉， 公司将在收到您的投诉后将依据中国法律法规和政府规范性文件及作业无忧平台管理规定采取措施进行处理， 包括但不限于移除相关内容或屏蔽相关链接， 以及其他公司认为适当的处理方式， 情节严重者， 公司有权向政府相关部门进行举报。

    三、 广告及推广

    1. 公司有权根据其现行有效的政策自行决定， 使用作业无忧为公司或任何第三方的产品或服务提供广告、 推广或任何增值服务， 且因该等广告、 推广或增值服务而获取的任何收益（ 如有） 均由公司单独享有。

    2. 公司有权， 无需事先向您通知， 自行决定更改利用作业无忧展示、 发布广告或进行推广的形式、 模式和范围； 您应意识到作业无忧上展示给您的内容， 包括但不限于作业无忧中的广告及推广服务中展示的内容， 可能受知识产权的保护。 您不得修改、 租赁、 出租、 出借、 出售、 分发该内容（ 无论全部还是部分） 或根据该内容创作衍生作品， 除非公司或内容权利人在相关协议、 相关业务规则中特别告知您可以为之。

    3. 您于作业无忧或经由作业无忧与广告商进行通讯或商业往来， 或参与促销活动， 包含相关商品或服务之付款及交付， 以及前述交易其他任何相关条款、 条件、 保证或声明， 完全为您与前述广告商之间的行为， 公司不承担对广告及广告商进行审查、 甄别之义务； 以及公司不对您或广告商， 基于作业无忧发生的前述通讯、 商业往来或交易可能遭受的任何性质的损失或损害承担任何责任。

    四、 知识产权

    1. 公司拥有作业无忧的所有权， 包括其中的知识产权。 作业无忧受中华人民共和国著作权法的保护， 用户不得删除或以其他方式改变作业无忧上附带的版权、 商标或其他所有权声明或标识。 用户不得对作业无忧进行反向工程、 反向编译或反汇编， 不得试图进行任何获得作业无忧源代码的访问或行为， 不得发行、 出租、 信息网络传播、 翻译作业无忧软件。

    2. 作业无忧的用户不能侵犯包括他人的著作权在内的知识产权以及其他权利。 一旦由于用户的提问、 回答、 发言发生法律纠纷， 其责任在于用户本人， 与作业无忧及公司无关。

    3. 对于用户发表到作业无忧上的任何内容， 用户同意作业无忧在全世界范围内具有免费的、 永久性的、 不可撤销的、 非独家的和完全再许可的权利和许可， 以使用、 复制、 修改、 改编、 出版、 翻译、 据以创作衍生作品、 传播、 表演和展示此等内容（ 整体或部分）， 和 / 或将此等内容编入当前已知的或以后开发的其他任何形式的作品、 媒体或技术中。 并且， 用户许可作业无忧公司有权利就任何主体侵权而单独采取法律行动（ 包括但不限于诉讼、 举报、 律师函等形式）。

    4. 作业无忧用户的言论侵犯了第三方的著作权或其他权利， 第三方提出异议的时候， 作业无忧有权删除相关的内容， 提出异议者和用户之间以和解、 调解、 仲裁、 诉讼等方式解决了争议后， 以此为依据， 作业无忧在得到有关申请后可以恢复被删除的内容。

    5. 用户从作业无忧的服务中获得的信息在没有得到事先许可的情况下， 自行或提供给第三方利用复制， 发送， 传播等手段用于盈利目的时， 将追究相关当事人的法律责任。

    6. 未经本公司事先许可， 禁止使用任何机器人、 爬虫程序、 其他自动设备， 或手动程序等来监视或复制作业无忧网页或其所包含的任何内容。 否则， 作业无忧有权依法追究法律责任。

    7. 如果第三方要使用作业无忧上的提问、 回答或评论的， 则需要事先获得相关用户同意后方能使用。

    五、 不允诺担保、 责任有限及免责

    1. 不允诺担保： 作业无忧用户提问、 回答、 发言仅代表用户个人观点， 与公司无关， 且作业无忧不对用户发表的回答或评论的正确性、 准确性、 真实性进行保证。 作业无忧为按现状提供， 包含瑕疵及缺陷， 公司不提供任何其他担保。 公司不允诺其他无论是明示的还是默示的保证和担保， 包括但不限于对特定目的的适销性和适应性， 不侵权， 以及任何出自交易过程或商业惯例的保证和条件。 从公司或他处获取的任何建议或信息， 不论是口头的还是书面的， 都不会对公司产生本协议明确约定之外的其他保证和担保。

    2. 责任有限： 适用法律所允许的最大范围内， 不论出于何种原因， 公司对您的全部责任为您为使用作业无忧的产品和服务而向公司支付的费用总额。 如果公司免费向您提供了作业无忧服务， 则公司无义务对您承担任何赔偿责任。 任何情况下， 公司不对出自本协议或与本协议有关的或与作业无忧的运行有关的任何特殊的、 偶然的、 惩罚性或间接的损害（ 包括但不限于数据损失、 利润损失或营业损失） 或采购替代产品承担责任， 不论该等责任是基于合同， 担保， 侵权（ 包括过失）， 严格责任或其他， 也不论公司是否被事先告知了损失或损害发生的可能性。 即使本协议约定的有限补救措施未能实现其根本目的， 前述的责任限制依然适用。

    3. 免责： 如因下所列任何原因而造成的用户资料泄露、 丢失、 被盗用或被篡改等， 公司均有权获得免责：

    （ 1） 任何因政府管制而造成的暂时性关闭等影响网络正常浏览的不可抗力原因；

    （ 2） 任何计算机系统问题、 黑客攻击、 计算机病毒侵入或发作的原因；

    （ 3） 任何因网络安全问题导致的账户或银行卡信息泄露， 该风险可能会给用户造成经济损失， 用户承诺自行承担向侵权方追究责任及追究责任不能的后果；

    （ 4） 任何因用户个人原因导致的用户资料泄露、 丢失、 被盗用或被篡改等；

    （ 5） 其他不能归责于公司的原因。

    六、 用户隐私声明

    1. 公司仅出于向用户提供更优质、 更个性化服务的目的收集用户的信息， 且， 公司重视未成年人的个人信息保护， 如您为未成年人， 请务必由您的监护人仔细阅读本隐私条款， 并在征得监护人同意的前提下使用作业无忧或向作业无忧提供相关用户信息。

    2. 在用户使用作业无忧的过程中， 公司将遵循合法、 正当、 必要的原则， 收集用户使用作业无忧的相关信息， 包括但不限于：

    （ 1） 用户注册或登录的账户信息， 例如用户注册账户使用的电话号码、 姓名或昵称， 用户自行填写的班级、 学校等；

    （ 2） 用户上传的信息， 例如用户的发帖、 评论、 分享、 用户主动填写的信息或用户与作业无忧客服联系时提供的相关信息等；

    （ 3） 用户使用作业无忧过程中产生的信息。 公司会根据用户授予的权限， 接收并记录用户所使用的设备相关信息， 例如设备属性信息、 设备位置信息、 设备连接信息等；

    （ 4） 作业无忧根据用户授权通过合法方式收集的其他用户信息。

    4. 公司非常重视用户的信息安全， 并尽最大合理努力采取各种合理的物理、 电子和管理方面的安全措施来保护用户信息， 确保用户信息不会被泄漏、 篡改、 毁损或丢失， 包括但不限于SSL、 信息加密存储、 数据中心的访问控制、 信息访问权限控制等。 且， 公司不会非法出售、 非法向他人提供用户信息； 公司不会将用户的该等信息提供给任何第三方， 也不会用于任何其他目的和用途， 但是以下情形除外， 1） 经用户事先同意， 向第三方披露； 2） 根据法律的有关规定， 或者行政或司法机构的要求， 向第三方或者行政、 司法机构披露； 3） 公司与第三方合作向用户提供作业无忧平台的相关服务或其他网络服务， 且该等第三方同意承担与公司同等的保护用户隐私的责任； 4） 其他根据法律、 法规或者政策应进行的披露。

    七、 其他

    1. 如果作业无忧平台上某一子服务附有单独的使用协议的， 则该子服务的使用将受该单独使用协议的约束。

    2. 本协议的签订、 生效、 履行、 争议的解决均适用中华人民共和国法律。

    3. 有关本协议的争议应通过友好协商解决， 如果协商不成， 该争议将提交公司所在地有管辖权的法院诉讼解决。

    4. 用户对作业无忧平台的意见及建议可通过客服电话与公司进行联系。



    © 2020 作业无忧 `
    },
    policyText: function () {
        return `作业无忧
作业无忧用户隐私政策

更新日期：2020 年 5 月 17 日


    作业无忧公司尊重并保护用户隐私，在您使用作业无忧APP平台（以下简称“作业无忧”）提供的服务时，我们除了按照《作业无忧用户服务协议》的约定向您提供服务外，我们还将按照《作业无忧用户隐私政策》（以下简称“本隐私政策”）遵循合法、正当、必要的原则，公开明示收集、使用您的个人信息。
    请您仔细阅读本隐私政策的全部条款以便您了解作业无忧收集、使用您个人信息的目的、范围、方式等。如果您为儿童，则请您在法定监护人陪同下审阅本隐私政策，经法定监护人审阅并同意后，您方可使用作业无忧并向作业无忧提供个人信息。如果您或监护人不同意本隐私政策任何内容，您应立即停止使用作业无忧产品或服务。当您使用作业无忧提供的任一服务时，即表示您已同意我们按照本隐私政策来收集、使用、存储和保护您的相关信息。
    我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
   
本隐私政策将帮您了解以下内容：
一、适用范围

二、我们如何收集和使用您的个人信息

三、我们如何使用 Cookie 和同类技术

四、我们如何共享、转让、公开披露您的个人信息

五、您如何管理自己的信息及账号注销

六、我们如何存储您的个人信息

七、我们如何保护您的个人信息

八、未成年人保护

九、本政策的修订

十、争议管辖

十一、联系我们


   
一、适用范围
    1. 本隐私政策适用于除某些特定产品和服务外作业无忧提供的所有服务。这些特定产品和服务将适用特定的隐私政策。
    2. 需要特别说明的是，本隐私政策不适用于除本隐私政策第四条约定经您确认的与第三方共享信息外其他第三方向您提供的服务。请您知悉：如果您浏览第三方网站或使用第三方产品、服务时向其提供个人信息，则您的信息应当适用该第三方的隐私政策，我们不承担任何法律责任，请您届时务必仔细阅读该第三方的隐私政策并确认是否接受。
   
二、我们如何收集和使用您的个人信息
    个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。14 岁以下（含）儿童的个人信息属于个人敏感信息。
    我们提供的产品和服务需要依赖您的部分信息才得以运行，因此在您使用作业无忧的时候，需要向我们提供或允许我们收集的必要信息以供我们使用这些信息向您提供基本服务及更优更好的个性化服务，包括：
1. 您主动提供给我们的信息
（1） 帮助您成为我们的用户，您填写的注册信息，包括您电话号码，以用于注册、登录作业无忧账户使用作业无忧产品和服务，及我们的客服和售后为您提供咨询服务，并保障您的账户安全。如果您仅需使用浏览、了解作业无忧等，您不需要注册成为我们的用户及提供上述信息；
（2） 便于我们向您提供服务，您填写的个人资料，包括您的姓名或昵称、性别、个人简介、身份、年级、班级、学校、入学年份、QQ，以用于课上互动、推荐合适的课程、推荐附近学校、发放虚拟奖励、推送线上活动。您可以根据是否需要个性化服务选择是否提供上述信息；
（3） 您在作业无忧购买需要邮寄的产品或课程附带的教辅资料时或者参加我们有关的市场营销活动时，您提供的姓名、通信地址、联系方式、甚至需要您实名认证等；以保障您的资金安全，便于您接收转账或者礼品，如果您拒绝提供这些信息，我们将无法向您寄送您购买的产品、教辅资料、礼品或转账；
（4） 当您与我们联系时，我们可能会保存您的通信或通话记录和内容或您留下的联系方式，以便帮助您解决问题，或记录相关问题的处理方案及结果。我们的客服会使用您的帐号信息与您核验您的身份。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息。
2. 我们在您使用服务过程中收集的信息，除法律规定情形外我们都将事先征得您的同意：
（1） 在您首次使用打开作业无忧app时，我们将在取得您的授权后，接收并记录您所使用的设备相关信息，包括设备属性信息（如IMEI、IMSI、设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备位置信息（如通过GPS、蓝牙或WIFI信号获得的位置信息）、设备连接信息（如IP地址、电信运营商、访问日期和时间等）等，以保障您的账户及交易安全；
（2） 在您首次使用打开作业无忧app时，我们将在您授权后读取您的读取手机状态，用以保障作业无忧APP应用服务的正常使用，更准确定位和解决在使用时遇到的问题，改进及优化作业无忧APP服务体验，及保障您的账号安全；
（3） 在您首次使用打开作业无忧app、下载错题、课程／拍照搜题、保存、上传图片（根据您的设备系统不同可能会有场景差异）时，我们将申请您的存储／（和相册）权限，以用于搜题功能、保存图片、文件或缓存信息到手机；
（4） 在您首次使用拍照搜题功能时，我们将申请您的地理位置权限，以提供搜索和推荐附件学校和本地区练习题服务；
（5） 在您首次使用拍照搜题、上传试卷、编辑个人资料头像调取摄像头拍摄时功能时，我们将申请获取您的摄像头权限，以用于拍照使用图像识别服务及搜索服务；
（6） 在您首次使用搜索框、直播间上课或古文助手时，我们将申请获取您的录音/音频权限，以用于向您提供语音搜索服务，在线上课互动连麦服务，帮助背诵服务；
（7） 在您购买直播课服务，首次写入日历时，我们将申请您的日历权限，以用于课程开售提醒。
3. 事先征得同意的例外：
（1） 与个人信息控制者履行法律法规规定的义务相关的；
（2） 与国家安全、国防安全直接相关的；
（3） 与公共安全、公共卫生、重大公共利益直接相关的；
（4） 与刑事侦查、起诉、审判和判决执行等直接相关的；
（5） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
（6） 所涉及的个人信息是个人信息主体自行向社会公众公开的；
（7） 根据个人信息主体要求签订和履行合同所必需的；
（8） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
（9） 维护所提供产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
（10） 个人信息控制者为新闻单位，且其开展合法的新闻报道所必需的。
4. 匿名化处理
对于我们收集到的您的信息，我们将通过技术手段及时进行匿名化处理。在不泄露您个人信息的前提下，我们有权对匿名化处理后的用户数据进行分析、挖掘和利用，有权对作业无忧产品的使用情况进行统计分析并用于可能的第三方信息共享。
   
三、我们如何使用 Cookie 和同类技术
    我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。我们使用自己的cookies和web beacon，目的是为您提供更个性化的用户体验和服务，并用于以下用途：
    1.记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息。
    2.分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动，或哪些服务最受您的欢迎。
    我们为上述目的使用cookies和web beacon的同时，可能将通过cookies和web beacon收集的非个人身份信息，经统计加工后提供给其他合作伙伴，用于分析用户如何使用我们的服务。
    我们的产品和服务上可能会有其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析您如何使用该等产品或服务。这些第三方cookies和web beacon收集和使用该等信息，不受本隐私政策约束，而是受相关第三方的隐私政策约束，我们不对此类cookies和web beacon承担责任。
    您可以通过浏览器设置拒绝或管理cookies。但请注意，如果停用cookies或web beacon，您有可能无法享受最佳的服务体验，某些产品或服务可能也无法正常使用。
   
四、我们如何共享、转让、公开披露您的个人信息
1. 我们会以高度的勤勉义务对待您的信息，除非获得您的明确同意，我们不会与本公司以外的任何公司、组织和个人分享您的个人信息，但经过处理无法识别特定个人且不能复原的除外。目前，我们会在以下情形中，向您征求您对共享个人信息的授权同意：
（1） 将您的设备信息、网络信息、位置信息共享至中移互联网有限公司、中国联合网络通信集团有限公司、中国电信集团有限公司用于一键登录验证、验证码接收；
（2） 将您的定位信息共享至北京百度网讯科技有限公司的百度地图SDK定位，用于您在完善个人资料选择学校时，定位附近的学校，为您提供更优质的服务；
（3） 将您的IP地址、浏览器类型、使用语言、访问日期和时间、软硬件特征信息及您需求的网页记录、设备型号、设备识别码、操作系统、分辨率、电信运营商共享至北京百度网讯科技有限公司的mtjSDK用于数据统计，以便提供更好的服务体验；
（4） 将您的Crash环境：Crash信息及线程堆栈，ROM/RAM/SD卡容量、网络/语言等状态App信息：包名、版本、所属进程名，设备信息：IMEI等设备识别分享至深圳市腾讯计算机系统有限公司的BuglySDK，用于判断Crash设备统计；
（5） 将您的手机状态、网络状态、读取写入外部储存共享至支付宝(中国)网络技术有限公司的支付宝SDK，用于处理和缓存您的支付订单及支付状态；
（6） 您可以将您感兴趣的内容利用作业无忧app中的分享功能分享到微信、朋友圈、QQ、QQ空间、新浪微博等，建议您在分享前了解第三方服务的隐私政策，便于您审慎决策。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理信息。
2. 我们不会非法出售、非法向他人提供您的信息；我们不会将您的该等信息提供给任何第三方，也不会用于任何其他目的和用途，但是以下情形除外：
（1） 经您事先同意，向第三方披露；
（2） 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
（3） 在我们提供服务时，可能将您的信息用于身份验证、客户服务、安全防范、诈骗监测、存档和备份等用途，以预防、发现、调查欺诈、危害安全、非法或违反与我们的协议、政策或规则的行为，以保护您、其他用户、我们的关联公司、合作伙伴及其他受信任的第三方供应商、服务商、代理商及社会公众的合法权益，以确保我们向您提供的产品和服务的安全性；
（4） 我们与第三方合作向您提供作业无忧平台的相关服务或其他网络服务，且该等第三方同意承担与我们同等的保护用户隐私的责任；
（5） 其他根据法律、法规或者政策应进行的披露。
3. 我们仅会在以下情形下，公开披露您的个人信息：
（1） 获得您明确同意后；
（2） 基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
4. 共享、转让、公开披露个人信息时事先征得授权同意的例外：
（1） 与个人信息控制者履行法律法规规定的义务相关的；
（2） 与国家安全、国防安全直接相关的；
（3） 与公共安全、公共卫生、重大公共利益直接相关的；
（4） 与刑事侦查、起诉、审判和判决执行等直接相关的；
（5） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
（6） 个人信息主体自行向社会公众公开的个人信息；
（7） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
5. 根据法律规定，共享、转让、披露经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理无需另行征得您的同意。
   
五、您如何管理自己的信息及账号注销
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
1. 查询权
您有权查询您的个人信息，法律法规规定的情形例外除外。
您可以通过“作业无忧-我的-头像-编辑资料”“作业无忧-我的-设置-账户与安全”查询或编辑您的账户中的个人资料信息、修改您的密码、实名认证、快递地址等信息。
2. 更正权
当您发现我们处理关于您的个人信息有错误时，您可以通过查询路径进行信息修改。
3. 删除权
以下情形下，您可以向我们提出删除个人信息的请求：
（1） 如果我们处理个人信息的行为违反法律法规；
（2） 如果我们收集、使用您的个人信息，却未征得您的同意；
（3） 如果我们处理个人信息的行为违反了与您的约定；
（4） 如果您不再使用我们的产品或服务，或您注销了账号；
（5） 如果我们不再为您提供产品或服务。
4. 撤销权
（1） 对于您个人主动提供的信息，您可以在您的个人账户“作业无忧-我的-头像-编辑资料”“作业无忧-我的-设置-账户与安全”中进行撤销您的个人信息；
（2） 对于您授权给我们的信息，您可以在“作业无忧-设置-隐私-权限管理”中进行撤销。请您注意，不同的设备中，路径可能有所不同，具体参考您的设备及系统开发方的说明和指引。
5. 注销权
如果您决定停止使用作业无忧的，则您可以对您的账号进行注销。账号注销可以在“作业无忧-我的-设置-账号与安全-注销作业无忧账号”中实现。注销账号之后此账号内的数据无法恢复，包括但不限于账户内的资产信息如学币、帮帮币、优惠券等；账号信息内容也将全部清除，包含但不限于该账号发布过的文章、评论等。该注销操作不能撤销，请您务必谨慎申请。
6. 在以下情形中，按照法律法规的要求，我们将无法响应您的上述请求：
（1） 与个人信息控制者履行法律法规规定的义务相关的；
（2） 与国家安全、国防安全直接相关的；
（3） 与公共安全、公共卫生、重大公共利益直接相关的；
（4） 与刑事侦查、起诉、审判和执行判决等直接相关的；
（5） 个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的；
（6） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
（7） 响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的；
（8） 涉及商业秘密的。
   
六、我们如何存储您的个人信息
    我们在中华人民共和国境内运营中收集和产生的个人信息，原则上存储在中国境内，并按照中国中华人民共和国法律法规、部门规章等规定的存储期限存储您的个人信息
   
七、我们如何保护您的个人信息
1. 我们非常重视您的个人信息安全。我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的个人信息，并尽最大合理努力使您的个人信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到您个人信息的员工或外包人员也采取了严格管理，包括但不限于采取信息访问权限控制、与接触个人信息的人员签署保密协议、监控该等人员的操作情况等措施。
2. 尽管有上述第1款的约定，但是请您理解并明白，由于存在各种各样无法预知或现有技术无法防御的恶意手段，即便我们已经尽力采取必要的保护措施，您的信息仍有可能被泄露、毁损或灭失。如您发现您的账号、密码因任何原因已经或者将要泄露时，您应当立即跟我们联系，以便我们可以及时采取应对措施防止或减少您的相关损失。
3. 如果我们发生企业合并、分立等情形的，则您的信息将由届时存续的企业主体继续履行保护义务，并由我们以公告、短信或其他书面方式通知您；如果我们的产品、服务停止运营的，则我们将及时停止继续收集您的信息，并以公告、短信等方式通知您，届时我们将对您的信息进行删除或隐匿化处理。
   
八、未成年人保护
   我们重视未成年人的个人信息保护，如您为十八周岁以下的未成年人，请在您的监护人指导下仔细阅读本隐私政策，并在征得您的监护人同意的前提下使用我们的服务及提交您的个人信息。如您的监护人不同意本隐私政策，您应立即停止使用作业无忧的服务并拒绝提供个人信息。
   如果您是未满十四周岁的未成年人，请您通知您的监护人共同阅读并接受我们的《作业无忧儿童用户隐私政策》并在您使用作业无忧服务、提交个人信息之前，寻求您的监护人的同意和指导。
   对于监护人同意而收集的儿童个人信息，我们仅会在法律法规允许、监护人明确同意或保护儿童用户的范围内使用或披露该信息。对于未经监护人同意而儿童用户提供的个人信息，在接到其监护人的通知后，我们会尽快删除相关信息。
   
九、本政策的修订
    我们可不定期修改本隐私政策，变更后的隐私政策将在修订生效前通过作业无忧平台公告或以其他适当方式通知您。该等情况下，若您继续使用我们的服务，即表示同意受经修订的隐私政策的约束。
   
十、争议管辖
1. 本隐私政策的签订、生效、履行、争议的解决均适用中华人民共和国法律。
2. 有关本协议的争议应通过友好协商解决，如果协商不成，该争议将提交公司所在地有管辖权的法院诉讼解决。
   
十一、联系我们
如您有任何疑问或投诉、举报，您可以通过客服电话联系我们。   
 ©2020作业无忧`
    }
}

module.exports = obj